ENGPO-783.org
#+TITLE:ENGPO-783 Journal
#+AUTHOR:Silas Curfman
#+OPTIONS: ^:nil
#+OPTIONS: toc:nil
#+SETUPFILE: theme-readtheorg.setup
* NOV - WITS Project Conversion
#+TOC: headlines 3
#+BEGIN: clocktable :scope subtree :maxlevel 2
#+CAPTION: Clock summary at [2023-11-07 Tue 13:51]
| Headline                      | Time   |      |
|-------------------------------+--------+------|
| *Total time*                  | *2:31* |      |
|-------------------------------+--------+------|
| NOV - WITS Project Conversion | 2:31   |      |
| \_  Progress Tracker [33%]    |        | 2:31 |
#+END:
** Summary
Convert existing customer project from (ESX-IOxp + CodeSys) to (ESX-4CT + LogiCAD)
** Deliverables
** Toolchains
Basic project.  No I/O's.  Program converts CAN messages to RS232.
+ CodeSys v2.3
+ LogiCAD
+ CodeSys conversion tool
+ OpenSYDE (mostly for flashing, no data pools)
+ Documentation (tbd)
+ Collaboration:
  + Jira
  + Google Drive (https://drive.google.com/drive/folders/1O7ZFR9QbyhWxfyTNf-_Wj9uYojleCJjX?usp=drive_link)
  + github (?)
** TODO Progress Tracker [33%]
*** DONE Original Project Review [2/2]
CLOSED: [2023-10-31 Tue 15:02]
 - [X] Review all provided docs
 - [X] Use codesys to confirm provided program opens and builds (witsconverter.pro)
Footnotes: no questions
*** DONE Base Project Creation [8/8]
CLOSED: [2023-11-07 Tue 12:37]
:LOGBOOK:
CLOCK: [2023-11-07 Tue 11:21]--[2023-11-07 Tue 12:37] =>  1:16
:END:
- [X] LogiCAD installed ?
- [X] OpenSYDE installed ?
- [X] Conversion Tool installed (lc3_codesys_converter.zip, plugin, bundle.info edit, & test)?
  - <2023-11-01 Wed> Had trouble with conversion tool.  Was using LogiCAD 3.6, moving to 3.22, and try again.
  - <2023-11-01 Wed 09:01> upgraded to logicad 3.22, edited bundles.info, added plugins directory. FIXED
- [X] CodeSys v2.3 installed ?
- [X] Open customer project .PRO file in CodeSys ?
- [X] Create empty OpenSyde project, launch logicad ide, test import a component from EXP file.
- [X] Add ESX-4CT TSP to openSyde
- [X] Add ESX-4CT TSP to logiCad
Footnotes:
+ Elements available to import from wits-converter.exp:
  + ADD_PADDING (FUNCTION)
  + CAN2ErrorHandling (PROGRAM)
  + CHEM_UNIT_CONVERT (FUNCTION)
  + CONSTANTS (GVL)
  + EDataChannel (DATATYPE)
  + ESerialState (DATATYPE)
  + FIND_ITEM_BY_PRIORITY (FUNCTION)
  + F_FLOAT_TO_STRING (FUNCTION)
  + F_RANDOM_CONFIG (FUNCTION)
  + F_UNIT_TO_STRING (FUNCTION)
  + Global_Variables (GVL)
  + HANDLE_EEPROM (PROGRAM)
  + HANDLE_HMI_CAN (PROGRAM)
  + HANDLE_RS232_SERIAL (PROGRAM)
  + J1939_DECODE (FUNCTION)
  + J1939_ENCODE (FUNCTION)
  + J1939_READ_PGN (FUNCTION)
  + J1939_SEND_PGN (FUNCTION)
  + MEMCMP (FUNCTION)
  + MEMCPY (FUNCTION)
  + PLC_PRG (PROGRAM)
  + READ_CAN_MSG (FUNCTION)
  + READ_WITS_CONFIG (PROGRAM)
  + REQUEST_PGN (FUNCTION)
  + SEND_CAN_MSG (FUNCTION)
  + SEND_WITS_CONFIG (PROGRAM)
  + SERIAL_PRINT (FUNCTION)
  + STRSIZE (FUNCTION)
  + TConfigData (DATATYPE)
  + TJ1939Msg (DATATYPE)
  + TSerialConfig (DATATYPE)
  + TWITSitem (DATATYPE)
  + Variable_Configuration (GVL)
  + errno_t (DATATYPE)
+ QUE: when installing conversion tool to logicad, get 'Path too long' errors, checking How-to text.
  + ANS: don't uznip.  just navigate to plugin folder and copy to desired plugins directory.
+ QUE: any benefit to importing a blank codesys 2.3 project just to see what global structure comes in by defalut?
  + ANS: only elements imported via a blank codesys project (ESX-IOxp template) are:
    + Global_Variables (GVL)
    + PLC_PRG (PROGRAM)
    + Variable_Configuration (GVL)
*** TODO CodeSys 2.3 EXPORT/IMPORT [0/6]
**** TODO Program Template / Setup
:LOGBOOK:
CLOCK: [2023-11-07 Tue 12:40]--[2023-11-07 Tue 13:49] =>  1:09
:END:
- [-] Prepare blank OpenSyde Project
  - [X] +add 4CT+
  - [X] +add CAN1.  Join 4CT to CAN1.+
  - [X] +save file i.e. importTemplate01 (?? which version, v3 or v2??)+
  - [X] +create datablock.  [x] File Generation (Source Code). Structure (V6??).  IDE Call, choose logicad version with importer tool.+
  - [X] Create BLANK OpenSyde Project
  - [X] add 4CT device from pallette
  - [X] add and connect 1x CAN bus to project
  - [X] SAVE
  - [X] Select device from tree, choose IMPORT TSP, select correct 4ct TSP package.
  - [X] in 'ApplBootCore' leave all settings and only change IDE call.  Point to the 'C' perspective version of logiCAD that has a working import tool.  Save / Close edit window.
  - [X] Save Project
  - [X] From ApplBootCore mini window, launch IDE
  - [ ] Confirm opens into logiCAD, test compile (need VPN access).  Should compile with no errors, still empty.
  - [ ] 
**** TODO GLOBALS
:LOGBOOK:
CLOCK: [2023-11-07 Tue 12:44]--[2023-11-07 Tue 12:50] =>  0:06
:END:
- [ ] CONSTANTS (CONSTANT)
- [ ] Global_Variable
- [ ] +Variable_Configuration+
**** TODO STRUCTURES
**** TODO ENUMS
**** TODO FUNCTIONS
**** TODO PROGRAMS
*** TODO PLC Config Conversion & Testing
Footnotes:
*** TODO Complete System Testing
Footnotes:
*** TODO Project Handoff
Footnotes:

