ENGPO-783.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-07 Tue 13:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ENGPO-783 Journal</title>
<meta name="author" content="Silas Curfman" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">ENGPO-783 Journal</h1>
<div id="outline-container-org852c332" class="outline-2">
<h2 id="org852c332"><span class="section-number-2">1.</span> NOV - WITS Project Conversion</h2>
<div class="outline-text-2" id="text-1">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org852c332">1. NOV - WITS Project Conversion</a>
<ul>
<li><a href="#org1492674">1.1. Summary</a></li>
<li><a href="#orge6c7251">1.2. Deliverables</a></li>
<li><a href="#orgd2ba43a">1.3. Toolchains</a></li>
<li><a href="#org0527f9d">1.4. <span class="todo TODO">TODO</span> Progress Tracker <code>[33%]</code></a>
<ul>
<li><a href="#org82ea7d8">1.4.1. <span class="done DONE">DONE</span> Original Project Review <code>[2/2]</code></a></li>
<li><a href="#org0310c9b">1.4.2. <span class="done DONE">DONE</span> Base Project Creation <code>[8/8]</code></a></li>
<li><a href="#orgc0bf625">1.4.3. <span class="todo TODO">TODO</span> CodeSys 2.3 EXPORT/IMPORT <code>[0/6]</code></a></li>
<li><a href="#orga16f7c4">1.4.4. <span class="todo TODO">TODO</span> PLC Config Conversion &amp; Testing</a></li>
<li><a href="#org8df6bdd">1.4.5. <span class="todo TODO">TODO</span> Complete System Testing</a></li>
<li><a href="#org80ba7a5">1.4.6. <span class="todo TODO">TODO</span> Project Handoff</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2023-11-07 Tue 13:51]</span></span></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Headline</th>
<th scope="col" class="org-right">Time</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Total time</b></td>
<td class="org-right"><b>2:31</b></td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">NOV - WITS Project Conversion</td>
<td class="org-right">2:31</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;Progress Tracker [33%]</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">2:31</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org1492674" class="outline-3">
<h3 id="org1492674"><span class="section-number-3">1.1.</span> Summary</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Convert existing customer project from (ESX-IOxp + CodeSys) to (ESX-4CT + LogiCAD)
</p>
</div>
</div>
<div id="outline-container-orge6c7251" class="outline-3">
<h3 id="orge6c7251"><span class="section-number-3">1.2.</span> Deliverables</h3>
</div>
<div id="outline-container-orgd2ba43a" class="outline-3">
<h3 id="orgd2ba43a"><span class="section-number-3">1.3.</span> Toolchains</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Basic project.  No I/O's.  Program converts CAN messages to RS232.
</p>
<ul class="org-ul">
<li>CodeSys v2.3</li>
<li>LogiCAD</li>
<li>CodeSys conversion tool</li>
<li>OpenSYDE (mostly for flashing, no data pools)</li>
<li>Documentation (tbd)</li>
<li>Collaboration:
<ul class="org-ul">
<li>Jira</li>
<li>Google Drive (<a href="https://drive.google.com/drive/folders/1O7ZFR9QbyhWxfyTNf-_Wj9uYojleCJjX?usp=drive_link">https://drive.google.com/drive/folders/1O7ZFR9QbyhWxfyTNf-_Wj9uYojleCJjX?usp=drive_link</a>)</li>
<li>github (?)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org0527f9d" class="outline-3">
<h3 id="org0527f9d"><span class="section-number-3">1.4.</span> <span class="todo TODO">TODO</span> Progress Tracker <code>[33%]</code></h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org82ea7d8" class="outline-4">
<h4 id="org82ea7d8"><span class="section-number-4">1.4.1.</span> <span class="done DONE">DONE</span> Original Project Review <code>[2/2]</code></h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Review all provided docs</li>
<li class="on"><code>[X]</code> Use codesys to confirm provided program opens and builds (witsconverter.pro)</li>
</ul>
<p>
Footnotes: no questions
</p>
</div>
</div>
<div id="outline-container-org0310c9b" class="outline-4">
<h4 id="org0310c9b"><span class="section-number-4">1.4.2.</span> <span class="done DONE">DONE</span> Base Project Creation <code>[8/8]</code></h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li class="on"><code>[X]</code> LogiCAD installed ?</li>
<li class="on"><code>[X]</code> OpenSYDE installed ?</li>
<li class="on"><code>[X]</code> Conversion Tool installed (lc3_codesys_converter.zip, plugin, bundle.info edit, &amp; test)?
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-11-01 Wed&gt; </span></span> Had trouble with conversion tool.  Was using LogiCAD 3.6, moving to 3.22, and try again.</li>
<li><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-11-01 Wed 09:01&gt; </span></span> upgraded to logicad 3.22, edited bundles.info, added plugins directory. FIXED</li>
</ul></li>
<li class="on"><code>[X]</code> CodeSys v2.3 installed ?</li>
<li class="on"><code>[X]</code> Open customer project .PRO file in CodeSys ?</li>
<li class="on"><code>[X]</code> Create empty OpenSyde project, launch logicad ide, test import a component from EXP file.</li>
<li class="on"><code>[X]</code> Add ESX-4CT TSP to openSyde</li>
<li class="on"><code>[X]</code> Add ESX-4CT TSP to logiCad</li>
</ul>
<p>
Footnotes:
</p>
<ul class="org-ul">
<li>Elements available to import from wits-converter.exp:
<ul class="org-ul">
<li>ADD_PADDING (FUNCTION)</li>
<li>CAN2ErrorHandling (PROGRAM)</li>
<li>CHEM_UNIT_CONVERT (FUNCTION)</li>
<li>CONSTANTS (GVL)</li>
<li>EDataChannel (DATATYPE)</li>
<li>ESerialState (DATATYPE)</li>
<li>FIND_ITEM_BY_PRIORITY (FUNCTION)</li>
<li>F_FLOAT_TO_STRING (FUNCTION)</li>
<li>F_RANDOM_CONFIG (FUNCTION)</li>
<li>F_UNIT_TO_STRING (FUNCTION)</li>
<li>Global_Variables (GVL)</li>
<li>HANDLE_EEPROM (PROGRAM)</li>
<li>HANDLE_HMI_CAN (PROGRAM)</li>
<li>HANDLE_RS232_SERIAL (PROGRAM)</li>
<li>J1939_DECODE (FUNCTION)</li>
<li>J1939_ENCODE (FUNCTION)</li>
<li>J1939_READ_PGN (FUNCTION)</li>
<li>J1939_SEND_PGN (FUNCTION)</li>
<li>MEMCMP (FUNCTION)</li>
<li>MEMCPY (FUNCTION)</li>
<li>PLC_PRG (PROGRAM)</li>
<li>READ_CAN_MSG (FUNCTION)</li>
<li>READ_WITS_CONFIG (PROGRAM)</li>
<li>REQUEST_PGN (FUNCTION)</li>
<li>SEND_CAN_MSG (FUNCTION)</li>
<li>SEND_WITS_CONFIG (PROGRAM)</li>
<li>SERIAL_PRINT (FUNCTION)</li>
<li>STRSIZE (FUNCTION)</li>
<li>TConfigData (DATATYPE)</li>
<li>TJ1939Msg (DATATYPE)</li>
<li>TSerialConfig (DATATYPE)</li>
<li>TWITSitem (DATATYPE)</li>
<li>Variable_Configuration (GVL)</li>
<li>errno_t (DATATYPE)</li>
</ul></li>
<li>QUE: when installing conversion tool to logicad, get 'Path too long' errors, checking How-to text.
<ul class="org-ul">
<li>ANS: don't uznip.  just navigate to plugin folder and copy to desired plugins directory.</li>
</ul></li>
<li>QUE: any benefit to importing a blank codesys 2.3 project just to see what global structure comes in by defalut?
<ul class="org-ul">
<li>ANS: only elements imported via a blank codesys project (ESX-IOxp template) are:
<ul class="org-ul">
<li>Global_Variables (GVL)</li>
<li>PLC_PRG (PROGRAM)</li>
<li>Variable_Configuration (GVL)</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc0bf625" class="outline-4">
<h4 id="orgc0bf625"><span class="section-number-4">1.4.3.</span> <span class="todo TODO">TODO</span> CodeSys 2.3 EXPORT/IMPORT <code>[0/6]</code></h4>
<div class="outline-text-4" id="text-1-4-3">
</div>
<ol class="org-ol">
<li><a id="org33c1943"></a><span class="todo TODO">TODO</span> Program Template / Setup<br />
<div class="outline-text-5" id="text-1-4-3-1">
<ul class="org-ul">
<li class="trans"><code>[-]</code> Prepare blank OpenSyde Project
<ul class="org-ul">
<li class="on"><code>[X]</code> <del>add 4CT</del></li>
<li class="on"><code>[X]</code> <del>add CAN1.  Join 4CT to CAN1.</del></li>
<li class="on"><code>[X]</code> <del>save file i.e. importTemplate01 (?? which version, v3 or v2??)</del></li>
<li class="on"><code>[X]</code> <del>create datablock.  [x] File Generation (Source Code). Structure (V6??).  IDE Call, choose logicad version with importer tool.</del></li>
<li class="on"><code>[X]</code> Create BLANK OpenSyde Project</li>
<li class="on"><code>[X]</code> add 4CT device from pallette</li>
<li class="on"><code>[X]</code> add and connect 1x CAN bus to project</li>
<li class="on"><code>[X]</code> SAVE</li>
<li class="on"><code>[X]</code> Select device from tree, choose IMPORT TSP, select correct 4ct TSP package.</li>
<li class="on"><code>[X]</code> in 'ApplBootCore' leave all settings and only change IDE call.  Point to the 'C' perspective version of logiCAD that has a working import tool.  Save / Close edit window.</li>
<li class="on"><code>[X]</code> Save Project</li>
<li class="on"><code>[X]</code> From ApplBootCore mini window, launch IDE</li>
<li class="off"><code>[&#xa0;]</code> Confirm opens into logiCAD, test compile (need VPN access).  Should compile with no errors, still empty.</li>
<li class="off"><code>[&#xa0;]</code> </li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org082237b"></a><span class="todo TODO">TODO</span> GLOBALS<br />
<div class="outline-text-5" id="text-1-4-3-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> CONSTANTS (CONSTANT)</li>
<li class="off"><code>[&#xa0;]</code> Global_Variable</li>
<li class="off"><code>[&#xa0;]</code> <del>Variable_Configuration</del></li>
</ul>
</div>
</li>
<li><a id="org3a377f7"></a><span class="todo TODO">TODO</span> STRUCTURES<br /></li>
<li><a id="org0a67e06"></a><span class="todo TODO">TODO</span> ENUMS<br /></li>
<li><a id="org886c7fb"></a><span class="todo TODO">TODO</span> FUNCTIONS<br /></li>
<li><a id="orgbc50416"></a><span class="todo TODO">TODO</span> PROGRAMS<br /></li>
</ol>
</div>
<div id="outline-container-orga16f7c4" class="outline-4">
<h4 id="orga16f7c4"><span class="section-number-4">1.4.4.</span> <span class="todo TODO">TODO</span> PLC Config Conversion &amp; Testing</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Footnotes:
</p>
</div>
</div>
<div id="outline-container-org8df6bdd" class="outline-4">
<h4 id="org8df6bdd"><span class="section-number-4">1.4.5.</span> <span class="todo TODO">TODO</span> Complete System Testing</h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
Footnotes:
</p>
</div>
</div>
<div id="outline-container-org80ba7a5" class="outline-4">
<h4 id="org80ba7a5"><span class="section-number-4">1.4.6.</span> <span class="todo TODO">TODO</span> Project Handoff</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
Footnotes:
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Silas Curfman</p>
<p class="date">Created: 2023-11-07 Tue 13:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>